Merge pull request #3 from josemartzrios/feature/003-architecture
Architecture for The Replicant
